build/docs/implementation/objects/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Object  Implementation of Mini Version of User Directory Application</title>
<!-- 2016-06-01 Wed 10:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Raj Manvar" />
</head>
<body>
<div id="content">
<h1 class="title">Object  Implementation of Mini Version of User Directory Application</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Initialization</a>
<ul>
<li><a href="#sec-1-1">1.1. Imports for Python API</a></li>
<li><a href="#sec-1-2">1.2. Imports and Initialization of testcases for Python API</a></li>
<li><a href="#sec-1-3">1.3. Imports for utility functions</a></li>
<li><a href="#sec-1-4">1.4. Init Files</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Object Model</a>
<ul>
<li><a href="#sec-2-1">2.1. Custom Exceptions</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. AttributeRequired</a></li>
<li><a href="#sec-2-1-2">2.1.2. ConstraintError</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Utility Functions</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. is_alphabetic_string(value)</a></li>
<li><a href="#sec-2-2-2">2.2.2. is_email(value)</a></li>
<li><a href="#sec-2-2-3">2.2.3. is_role(value):</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Name</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. Construction</a></li>
<li><a href="#sec-2-3-2">2.3.2. Test the Construction</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Email</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Construction</a></li>
<li><a href="#sec-2-4-2">2.4.2. Test the Construction</a></li>
<li><a href="#sec-2-4-3">2.4.3. Functions</a>
<ul>
<li><a href="#sec-2-4-3-1">2.4.3.1. getemail</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. User</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. Mutable Data</a></li>
<li><a href="#sec-2-5-2">2.5.2. Definition</a></li>
<li><a href="#sec-2-5-3">2.5.3. Constructor</a>
<ul>
<li><a href="#sec-2-5-3-1">2.5.3.1. Implementation</a></li>
<li><a href="#sec-2-5-3-2">2.5.3.2. Test the constructor</a></li>
</ul>
</li>
<li><a href="#sec-2-5-4">2.5.4. Functions</a>
<ul>
<li><a href="#sec-2-5-4-1">2.5.4.1. setEmail</a></li>
<li><a href="#sec-2-5-4-2">2.5.4.2. setName</a></li>
<li><a href="#sec-2-5-4-3">2.5.4.3. setRole</a></li>
<li><a href="#sec-2-5-4-4">2.5.4.4. getRole</a></li>
<li><a href="#sec-2-5-4-5">2.5.4.5. getEmail</a></li>
<li><a href="#sec-2-5-4-6">2.5.4.6. getName</a></li>
<li><a href="#sec-2-5-4-7">2.5.4.7. toClient</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. Role</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. Introduction</a></li>
<li><a href="#sec-2-6-2">2.6.2. Mutable Data</a></li>
<li><a href="#sec-2-6-3">2.6.3. Definition</a></li>
<li><a href="#sec-2-6-4">2.6.4. Constructor</a></li>
<li><a href="#sec-2-6-5">2.6.5. Test Constructor</a></li>
<li><a href="#sec-2-6-6">2.6.6. Functions</a>
<ul>
<li><a href="#sec-2-6-6-1">2.6.6.1. setrole</a></li>
<li><a href="#sec-2-6-6-2">2.6.6.2. getrole</a></li>
<li><a href="#sec-2-6-6-3">2.6.6.3. getAll: Nil &#x2013;&gt; set[Role]</a></li>
<li><a href="#sec-2-6-6-4">2.6.6.4. to_client</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. Session</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1. Introduction</a></li>
<li><a href="#sec-2-7-2">2.7.2. Mutable Data</a></li>
<li><a href="#sec-2-7-3">2.7.3. Definition</a></li>
<li><a href="#sec-2-7-4">2.7.4. Constructor</a></li>
<li><a href="#sec-2-7-5">2.7.5. Test Constructor</a></li>
<li><a href="#sec-2-7-6">2.7.6. Functions</a>
<ul>
<li><a href="#sec-2-7-6-1">2.7.6.1. get_user</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-8">2.8. System</a>
<ul>
<li><a href="#sec-2-8-1">2.8.1. Introduction</a></li>
<li><a href="#sec-2-8-2">2.8.2. Mutable Data</a></li>
<li><a href="#sec-2-8-3">2.8.3. Definition</a></li>
<li><a href="#sec-2-8-4">2.8.4. Constructor</a></li>
<li><a href="#sec-2-8-5">2.8.5. Test Constructor</a></li>
<li><a href="#sec-2-8-6">2.8.6. Functions</a>
<ul>
<li><a href="#sec-2-8-6-1">2.8.6.1. adduser</a></li>
<li><a href="#sec-2-8-6-2">2.8.6.2. showUsers</a></li>
<li><a href="#sec-2-8-6-3">2.8.6.3. deluser</a></li>
<li><a href="#sec-2-8-6-4">2.8.6.4. getuserbyemail</a></li>
<li><a href="#sec-2-8-6-5">2.8.6.5. getEmail</a></li>
<li><a href="#sec-2-8-6-6">2.8.6.6. getName</a></li>
<li><a href="#sec-2-8-6-7">2.8.6.7. getrole</a></li>
<li><a href="#sec-2-8-6-8">2.8.6.8. setEmail</a></li>
<li><a href="#sec-2-8-6-9">2.8.6.9. setName</a></li>
<li><a href="#sec-2-8-6-10">2.8.6.10. showsessions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-9">2.9. Main</a>
<ul>
<li><a href="#sec-2-9-1">2.9.1. Construction</a></li>
<li><a href="#sec-2-9-2">2.9.2. Test the Construction</a></li>
<li><a href="#sec-2-9-3">2.9.3. Functions</a>
<ul>
<li><a href="#sec-2-9-3-1">2.9.3.1. login</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Run Test Cases</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Initialization</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Imports for Python API</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-*- coding: utf-8 -*-</span>
<span style="font-weight: bold;">from</span> op_exceptions <span style="font-weight: bold;">import</span> AttributeRequired
<span style="font-weight: bold;">from</span> op_exceptions <span style="font-weight: bold;">import</span> ConstraintError
<span style="font-weight: bold;">from</span> utils <span style="font-weight: bold;">import</span> *
<span style="font-weight: bold;">import</span> copy
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Imports and Initialization of testcases for Python API</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">-*- coding: utf-8 -*-</span>
<span style="font-weight: bold;">import</span> unittest
<span style="font-weight: bold;">from</span> unittest <span style="font-weight: bold;">import</span> TestCase
<span style="font-weight: bold;">from</span> datetime <span style="font-weight: bold;">import</span> datetime

<span style="font-weight: bold;">from</span> src.obj <span style="font-weight: bold;">import</span> *
<span style="font-weight: bold;">from</span> src.op_exceptions <span style="font-weight: bold;">import</span> AttributeRequired
<span style="font-weight: bold;">from</span> src.op_exceptions <span style="font-weight: bold;">import</span> ConstraintError
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Imports for utility functions</h3>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Init Files</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> obj
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">print</span> <span style="font-style: italic;">"tests package"</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Object Model</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Custom Exceptions</h3>
<div class="outline-text-3" id="text-2-1">
<p>
These are some of the custom exceptions used in the application.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> AttributeRequired</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">AttributeRequired</span>(<span style="font-weight: bold; text-decoration: underline;">Exception</span>):
    <span style="font-weight: bold;">str</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, <span style="font-weight: bold;">str</span>):
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">str</span> = <span style="font-weight: bold;">str</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">repr</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">str</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> ConstraintError</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ConstraintError</span>(<span style="font-weight: bold; text-decoration: underline;">Exception</span>):
    <span style="font-weight: bold;">str</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, <span style="font-weight: bold;">str</span>):
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">str</span> = <span style="font-weight: bold;">str</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">repr</span>(<span style="font-weight: bold;">self</span>.<span style="font-weight: bold;">str</span>)
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Utility Functions</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> is_alphabetic_string(value)</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
This function take an argument and checks whether the argument contains
only alphabets.
</p>
</div>
</div>
