build/docs/implementation/objects/index.html

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> is_email(value)</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Email is a type as defined in RFC <a href="https://tools.ietf.org/html/rfc5321">5321</a>, <a href="https://tools.ietf.org/html/rfc5322">5322</a> and <a href="https://tools.ietf.org/html/rfc6531">6531</a>.
Following is the constructor for this class.
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> is_role(value):</h4>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Name</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> Construction</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Name is an alphabetical string.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Name</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; font-style: italic;">value</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, value):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">value: String </span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">if the string contains any non-alphabet and non-space character,</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">raise a type error</span>
        <span style="font-weight: bold;">if</span> is_alphabetic_string(value):
            <span style="font-weight: bold;">self</span>.value = value
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">'%s is not a Name!'</span> % value)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.value
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> Test the Construction</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestName</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_name_type</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_name_type"</span>
        <span style="font-weight: bold; font-style: italic;">new_name</span> = Name(<span style="font-style: italic;">"John"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">correct name</span>
        <span style="font-weight: bold;">self</span>.assertEqual(new_name.value, <span style="font-style: italic;">"John"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">incorrect name</span>
        <span style="font-weight: bold;">self</span>.assertRaises(<span style="font-weight: bold; text-decoration: underline;">TypeError</span>, Name, <span style="font-style: italic;">"123dasd"</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Email</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Construction</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
Email is a type as defined in RFC <a href="https://tools.ietf.org/html/rfc5321">5321</a>, <a href="https://tools.ietf.org/html/rfc5322">5322</a> and <a href="https://tools.ietf.org/html/rfc6531">6531</a>.
Following is the constructor for this class.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Email</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; font-style: italic;">value</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, value):
        <span style="font-weight: bold;">if</span> is_email(value) :
           <span style="font-weight: bold;">self</span>.value = value
        <span style="font-weight: bold;">else</span> :
           <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">'%s is not a Email!'</span> % value)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__str__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.value
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Test the Construction</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestEmail</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_email_type</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_email_type"</span>
        <span style="font-weight: bold; font-style: italic;">new_email</span> = Email(<span style="font-style: italic;">"Johnw@gmail.com"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">correct name</span>
        <span style="font-weight: bold;">self</span>.assertEqual(new_email.value, <span style="font-style: italic;">"Johnw@gmail.com"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">incorrect name</span>
        <span style="font-weight: bold;">self</span>.assertRaises(<span style="font-weight: bold; text-decoration: underline;">TypeError</span>, Email, <span style="font-style: italic;">"sdfsdfsdfsfsdf"</span>)
</pre>
</div>
</div>
</div>
