build/docs/implementation/objects/index.html
<div id="outline-container-sec-2-5-4-3" class="outline-5">
<h5 id="sec-2-5-4-3"><span class="section-number-5">2.5.4.3</span> setRole</h5>
<div class="outline-text-5" id="text-2-5-4-3">
</div><ol class="org-ol"><li><a id="sec-2-5-4-3-1" name="sec-2-5-4-3-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-5-4-3-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">set_role</span>(<span style="font-weight: bold;">self</span>, role):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(role,Role):
            <span style="font-weight: bold;">self</span>.role = role;
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">'attribute must be an istance of Role class'</span>)
</pre>
</div>
</div>
</li>
<li><a id="sec-2-5-4-3-2" name="sec-2-5-4-3-2"></a>Test<br  /></li></ol>
</div>

<div id="outline-container-sec-2-5-4-4" class="outline-5">
<h5 id="sec-2-5-4-4"><span class="section-number-5">2.5.4.4</span> getRole</h5>
<div class="outline-text-5" id="text-2-5-4-4">
</div><ol class="org-ol"><li><a id="sec-2-5-4-4-1" name="sec-2-5-4-4-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-5-4-4-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_role</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.role.value
</pre>
</div>
</div>
</li>
<li><a id="sec-2-5-4-4-2" name="sec-2-5-4-4-2"></a>Test<br  /></li></ol>
</div>


<div id="outline-container-sec-2-5-4-5" class="outline-5">
<h5 id="sec-2-5-4-5"><span class="section-number-5">2.5.4.5</span> getEmail</h5>
<div class="outline-text-5" id="text-2-5-4-5">
<div class="org-src-container">

<pre class="src src-python">   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_email</span>(<span style="font-weight: bold;">self</span>):
       <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.email.value
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5-4-6" class="outline-5">
<h5 id="sec-2-5-4-6"><span class="section-number-5">2.5.4.6</span> getName</h5>
<div class="outline-text-5" id="text-2-5-4-6">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_name</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.name.value
</pre>
</div>
</div>
</div>




<div id="outline-container-sec-2-5-4-7" class="outline-5">
<h5 id="sec-2-5-4-7"><span class="section-number-5">2.5.4.7</span> toClient</h5>
<div class="outline-text-5" id="text-2-5-4-7">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">to_client</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">pass</span>
<span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">return {</span>
<span style="font-weight: bold; font-style: italic;">#            </span><span style="font-weight: bold; font-style: italic;">'name': self.name,</span>
<span style="font-weight: bold; font-style: italic;">#            </span><span style="font-weight: bold; font-style: italic;">'email': self.email,</span>
<span style="font-weight: bold; font-style: italic;">#            </span><span style="font-weight: bold; font-style: italic;">'role': self.role.to_client()</span>
<span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Role</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Introduction</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
A Role has got certain privileges.  In this current application, the
privileges are understood 
</p>

<p>
Different types of roles are:
</p>
<dl class="org-dl">
<dt> Admin </dt><dd>An admin is an user who can add, modify and delete other users
except himself.
</dd>
<dt> User </dt><dd>A User is a user who can view all other users and can modify himself.
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> Mutable Data</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
These are the data associated with Role type, which are mutable
</p>

<ul class="org-ul">
<li>Name
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="section-number-4">2.6.3</span> Definition</h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Role</span>():
    <span style="font-weight: bold; font-style: italic;">value</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-4" class="outline-4">
<h4 id="sec-2-6-4"><span class="section-number-4">2.6.4</span> Constructor</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
The signature of Role is defined as follows
</p>
<pre class="example">
role = Role("admin")
</pre>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, string):
        <span style="font-weight: bold;">if</span> is_role(string)==<span style="font-weight: bold; text-decoration: underline;">False</span>:
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">"Role can be admin or normal"</span>)
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">self</span>.value = string
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6-5" class="outline-4">
<h4 id="sec-2-6-5"><span class="section-number-4">2.6.5</span> Test Constructor</h4>
<div class="outline-text-4" id="text-2-6-5">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestRole</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_role_creation</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"test_role"</span>
        <span style="font-weight: bold; font-style: italic;">new_name</span> = Name(<span style="font-style: italic;">"admin"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">correct name</span>
        <span style="font-weight: bold;">self</span>.assertEqual(new_name.value, <span style="font-style: italic;">"admin"</span>)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">incorrect name</span>
        <span style="font-weight: bold;">self</span>.assertRaises(<span style="font-weight: bold; text-decoration: underline;">TypeError</span>, Role, <span style="font-style: italic;">"adminnormal"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-6" class="outline-4">
<h4 id="sec-2-6-6"><span class="section-number-4">2.6.6</span> Functions</h4>
<div class="outline-text-4" id="text-2-6-6">
</div><div id="outline-container-sec-2-6-6-1" class="outline-5">
<h5 id="sec-2-6-6-1"><span class="section-number-5">2.6.6.1</span> setrole</h5>
<div class="outline-text-5" id="text-2-6-6-1">
</div><ol class="org-ol"><li><a id="sec-2-6-6-1-1" name="sec-2-6-6-1-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-6-6-1-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">set_role</span>(<span style="font-weight: bold;">self</span>, name):
        <span style="font-weight: bold;">if</span> is_role(name)==<span style="font-weight: bold; text-decoration: underline;">False</span> :
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">"role can be admin or normal"</span>)
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">self</span>.value = name
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-2-6-6-1-1-1" name="sec-2-6-6-1-1-1"></a>Test<br  /><div class="outline-text-7" id="text-2-6-6-1-1-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_role_set_name</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">temp_role</span> = Role(<span style="font-style: italic;">'admin'</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(temp_role.value,<span style="font-style: italic;">'admin'</span>)
        temp_role.set_role(<span style="font-style: italic;">'normal'</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(temp_role.value,<span style="font-style: italic;">'normal'</span>)
</pre>
</div>
</div>
</li></ol>
</li></ol>
</div>


<div id="outline-container-sec-2-6-6-2" class="outline-5">
<h5 id="sec-2-6-6-2"><span class="section-number-5">2.6.6.2</span> getrole</h5>
<div class="outline-text-5" id="text-2-6-6-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_role</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.value
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-6-3" class="outline-5">
<h5 id="sec-2-6-6-3"><span class="section-number-5">2.6.6.3</span> getAll: Nil &#x2013;&gt; set[Role]</h5>
<div class="outline-text-5" id="text-2-6-6-3">
</div><ol class="org-ol"><li><a id="sec-2-6-6-3-1" name="sec-2-6-6-3-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-6-6-3-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_all</span>():
<span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">return ('admin','normal')</span>
        <span style="font-weight: bold;">pass</span>
</pre>
</div>
</div>
</li>


<li><a id="sec-2-6-6-3-2" name="sec-2-6-6-3-2"></a>Test getAll: Nil &#x2013;&gt; set[Role]<br  /><div class="outline-text-6" id="text-2-6-6-3-2">
<div class="org-src-container">

<pre class="src src-python">   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_role_get_all</span>(<span style="font-weight: bold;">self</span>):
       <span style="font-weight: bold; font-style: italic;">temp_role</span> = Role(<span style="font-style: italic;">'admin'</span>)
       <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">self.assertEqual(temp_role.get_all(),('admin','normal'))</span>
</pre>
</div>
</div>
</li></ol>
</div>
