src/implementation/objects/index.org
**** to_client
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
    def to_client(self):
        print "fill"
#+END_SRC



** Session

*** Introduction
    Session class essentially has the methods for addition, deletion and
    editing the user. It gives a session instance which will do all these
    things required. 
    User cannot be edited or deleted when he/she is logged in
    There has to be atleast one admin
    Also getting all the email and named for the phone book are added here
    Vaildations are taken care in User function.

*** Mutable Data

     These are the data associated with Role type, which are mutable

     + User
     + session_list


*** Definition
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
class Session():
    user = None
#+END_SRC


*** Constructor

    The signature of Session is defined as follows
    #+BEGIN_EXAMPLE
    sesssion_instance = session(user)
    #+END_EXAMPLE

#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
    def __init__(self, user):
        if not isinstance(user,User):
            raise TypeError('only instnaces of user class can get session')
        self.user = user
#+END_SRC

*** Test Constructor
#+BEGIN_SRC python :tangle ../../tests/test_obj.py :eval no
class TestSession(TestCase):
    TESTING = True
    

#+END_SRC


*** Functions


**** get_user
***** Implementation
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
    def get_user(self):
            return self.user

#+END_SRC

***** Test
#+BEGIN_SRC python :tangle ../../tests/test_obj.py :eval no
    def test_addsession(self):
        print 'testing session:add session'
        temp = {'name': Name('john'), 'email': Email('john@gmail.com') , 'role': Role('admin') }
        inst = User(temp)
        sess = Session(inst)
        self.assertEqual(inst,sess.get_user())
#+END_SRC


** System

*** Introduction
    
    System class has all the system functions like get user, set user
    delete user.

    
*** Mutable Data

     These are the data associated with Role type, which are mutable
     


*** Definition
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
class System():
    users = []
    session_list = []
#+END_SRC

*** Constructor

*** Test Constructor
 #+BEGIN_SRC python :tangle ../../tests/test_obj.py :eval no
sys = System()
class TestSystem(TestCase):

    TESTING = True
    
    def setUp(self):
        temp = {'name': Name('john'), 'email': Email('john@gmail.com') , 'role': Role('admin') }
        temp1 = {'name': Name('johnsnow'), 'email': Email('johnsnow@gmail.com') , 'role': Role('normal') }
        inst = User(temp)        
        sessi = Session(inst)
        inst1 = User(temp1)
        sessi1 = Session(inst1)
        global sys
        sys.users.append(inst)
        sys.session_list.append(sessi)
        sys.users.append(inst1)
        sys.session_list.append(sessi1)

    def tearDown(self):
        global sys
        sys.users = []
        sys.session_list = []

#+END_SRC


*** Functions

**** adduser
