build/docs/implementation/objects/index.html


<div id="outline-container-sec-2-6-6-4" class="outline-5">
<h5 id="sec-2-6-6-4"><span class="section-number-5">2.6.6.4</span> to_client</h5>
<div class="outline-text-5" id="text-2-6-6-4">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">to_client</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"fill"</span>
</pre>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Session</h3>
<div class="outline-text-3" id="text-2-7">
</div><div id="outline-container-sec-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> Introduction</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Session class essentially has the methods for addition, deletion and
editing the user. It gives a session instance which will do all these
things required. 
User cannot be edited or deleted when he/she is logged in
There has to be atleast one admin
Also getting all the email and named for the phone book are added here
Vaildations are taken care in User function.
</p>
</div>
</div>

<div id="outline-container-sec-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> Mutable Data</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
These are the data associated with Role type, which are mutable
</p>

<ul class="org-ul">
<li>User
</li>
<li>session_list
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-7-3" class="outline-4">
<h4 id="sec-2-7-3"><span class="section-number-4">2.7.3</span> Definition</h4>
<div class="outline-text-4" id="text-2-7-3">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Session</span>():
    <span style="font-weight: bold; font-style: italic;">user</span> = <span style="font-weight: bold; text-decoration: underline;">None</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-7-4" class="outline-4">
<h4 id="sec-2-7-4"><span class="section-number-4">2.7.4</span> Constructor</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
The signature of Session is defined as follows
</p>
<pre class="example">
sesssion_instance = session(user)
</pre>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, user):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">isinstance</span>(user,User):
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">'only instnaces of user class can get session'</span>)
        <span style="font-weight: bold;">self</span>.user = user
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-7-5" class="outline-4">
<h4 id="sec-2-7-5"><span class="section-number-4">2.7.5</span> Test Constructor</h4>
<div class="outline-text-4" id="text-2-7-5">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestSession</span>(TestCase):
    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-7-6" class="outline-4">
<h4 id="sec-2-7-6"><span class="section-number-4">2.7.6</span> Functions</h4>
<div class="outline-text-4" id="text-2-7-6">
</div><div id="outline-container-sec-2-7-6-1" class="outline-5">
<h5 id="sec-2-7-6-1"><span class="section-number-5">2.7.6.1</span> get_user</h5>
<div class="outline-text-5" id="text-2-7-6-1">
</div><ol class="org-ol"><li><a id="sec-2-7-6-1-1" name="sec-2-7-6-1-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-7-6-1-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_user</span>(<span style="font-weight: bold;">self</span>):
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.user
</pre>
</div>
</div>
</li>

<li><a id="sec-2-7-6-1-2" name="sec-2-7-6-1-2"></a>Test<br  /><div class="outline-text-6" id="text-2-7-6-1-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_addsession</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing session:add session'</span>
        <span style="font-weight: bold; font-style: italic;">temp</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'john'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'john@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'admin'</span>) }
        <span style="font-weight: bold; font-style: italic;">inst</span> = User(temp)
        <span style="font-weight: bold; font-style: italic;">sess</span> = Session(inst)
        <span style="font-weight: bold;">self</span>.assertEqual(inst,sess.get_user())
</pre>
</div>
</div>
</li></ol>
</div>
</div>
</div>


<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> System</h3>
<div class="outline-text-3" id="text-2-8">
</div><div id="outline-container-sec-2-8-1" class="outline-4">
<h4 id="sec-2-8-1"><span class="section-number-4">2.8.1</span> Introduction</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
System class has all the system functions like get user, set user
delete user.
</p>
</div>
</div>


<div id="outline-container-sec-2-8-2" class="outline-4">
<h4 id="sec-2-8-2"><span class="section-number-4">2.8.2</span> Mutable Data</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
These are the data associated with Role type, which are mutable
</p>
</div>
</div>



<div id="outline-container-sec-2-8-3" class="outline-4">
<h4 id="sec-2-8-3"><span class="section-number-4">2.8.3</span> Definition</h4>
<div class="outline-text-4" id="text-2-8-3">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">System</span>():
    <span style="font-weight: bold; font-style: italic;">users</span> = []
    <span style="font-weight: bold; font-style: italic;">session_list</span> = []
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-8-4" class="outline-4">
<h4 id="sec-2-8-4"><span class="section-number-4">2.8.4</span> Constructor</h4>
</div>

<div id="outline-container-sec-2-8-5" class="outline-4">
<h4 id="sec-2-8-5"><span class="section-number-4">2.8.5</span> Test Constructor</h4>
<div class="outline-text-4" id="text-2-8-5">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">sys</span> = System()
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestSystem</span>(TestCase):

    <span style="font-weight: bold; font-style: italic;">TESTING</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">setUp</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold; font-style: italic;">temp</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'john'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'john@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'admin'</span>) }
        <span style="font-weight: bold; font-style: italic;">temp1</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'johnsnow'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'johnsnow@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'normal'</span>) }
        <span style="font-weight: bold; font-style: italic;">inst</span> = User(temp)        
        <span style="font-weight: bold; font-style: italic;">sessi</span> = Session(inst)
        <span style="font-weight: bold; font-style: italic;">inst1</span> = User(temp1)
        <span style="font-weight: bold; font-style: italic;">sessi1</span> = Session(inst1)
        <span style="font-weight: bold;">global</span> sys
        sys.users.append(inst)
        sys.session_list.append(sessi)
        sys.users.append(inst1)
        sys.session_list.append(sessi1)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">tearDown</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">sys.users</span> = []
        <span style="font-weight: bold; font-style: italic;">sys.session_list</span> = []
</pre>
</div>
</div>
</div>
