src/implementation/objects/index.org
***** Implementation
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
  
    def add_user(self,user,session):
        if isinstance(user,User) and isinstance(session,Session):
            if session.get_user().get_role()=='admin':
                if user.get_email() not in [self.users[i].get_email() for i in range(0,len(self.users))]:
                    self.users.append(user)
                    return True
                else :
                    raise ConstraintError ('User already exists')
                    return False
            else :
                raise ConstraintError ('User must be admin to add a new user')
                return False
        else:
            raise ConstraintError ('instances of user and session must be passed')            
            return False

#+END_SRC

***** Test
#+BEGIN_SRC python :tangle ../../tests/test_obj.py :eval no
    def test_adduser(self):
        print 'testing System: adduser'
        global sys
        admin_logged = [s for s in sys.session_list if s.get_user().get_role()=='admin']
        normal_logged = [s for s in sys.session_list if s.get_user().get_role()=='normal']
        with self.assertRaises(ConstraintError): # trying to add same user
            sys.add_user(normal_logged[0].get_user(),admin_logged)
        with self.assertRaises(ConstraintError): # normal uesr trying to add user
            temp2 = {'name': Name('raj'), 'email': Email('raj@gmail.com') , 'role': Role('admin') }
            inst2 = User(temp2)
            sys.add_user(inst2,normal_logged[0])
        with self.assertRaises(ConstraintError): # proper instances not passed
            temp2 = {'name': Name('raj'), 'email': Email('raj@gmail.com') , 'role': Role('admin') }
            inst2 = User(temp2)
            sys.add_user(admin_logged[0],inst2)

        
#+END_SRC


**** showUsers
***** Implementation
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no
  
    def show_users(self,session):
        if isinstance(session,Session):
            if session in self.session_list :
                return copy.deepcopy(self.users)
            else :
                raise ConstraintError('Session not in session list')
        else:
            raise ConstraintError ('Instance of session not passed')            

#+END_SRC

***** Test
#+BEGIN_SRC python :tangle ../../tests/test_obj.py :eval no
    def test_showusers(self):
        print 'testing System: show_users'
        global sys
        admin_logged = [s for s in sys.session_list if s.get_user().get_role()=='admin']
        normal_logged = [s for s in sys.session_list if s.get_user().get_role()=='normal']
        a = sys.show_users(admin_logged[0])
        for i in range(0,len(a)):
            self.assertEqual(str(a[i].get_email()),str(sys.users[i].get_email()))
            self.assertEqual(str(a[i].get_name()),str(sys.users[i].get_name()))
            self.assertEqual(str(a[i].get_role()),str(sys.users[i].get_role()))


#+END_SRC


**** deluser
***** Implementation
#+BEGIN_SRC python :tangle ../../src/obj.py :eval no

    def del_user(self,user,session):
        if isinstance(user,User) and isinstance(session,Session):
            if session.get_user().get_role()=='admin' and user.get_role()!='admin' and session.get_user()!=user:
                 if user in self.users and session in self.session_list :
                    self.users.remove(user)
                 else :
                    raise ConstraintError('user not in list or session not present')
            else :
                raise ConstraintError('only admin can delete and admin cannot be removed')
        else:
            raise ConstraintError ('Instance of user and session not passed')            

#+END_SRC

