build/docs/implementation/objects/index.html


<div id="outline-container-sec-2-8-6" class="outline-4">
<h4 id="sec-2-8-6"><span class="section-number-4">2.8.6</span> Functions</h4>
<div class="outline-text-4" id="text-2-8-6">
</div><div id="outline-container-sec-2-8-6-1" class="outline-5">
<h5 id="sec-2-8-6-1"><span class="section-number-5">2.8.6.1</span> adduser</h5>
<div class="outline-text-5" id="text-2-8-6-1">
</div><ol class="org-ol"><li><a id="sec-2-8-6-1-1" name="sec-2-8-6-1-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-1-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_user</span>(<span style="font-weight: bold;">self</span>,user,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> session.get_user().get_role()==<span style="font-style: italic;">'admin'</span>:
                <span style="font-weight: bold;">if</span> user.get_email() <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">in</span> [<span style="font-weight: bold;">self</span>.users[i].get_email() <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(0,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.users))]:
                    <span style="font-weight: bold;">self</span>.users.append(user)
                    <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
                <span style="font-weight: bold;">else</span> :
                    <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'User already exists'</span>)
                    <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'User must be admin to add a new user'</span>)
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'instances of user and session must be passed'</span>)            
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-1-2" name="sec-2-8-6-1-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-1-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_adduser</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: adduser'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">trying to add same user</span>
            sys.add_user(normal_logged[0].get_user(),admin_logged)
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">normal uesr trying to add user</span>
            <span style="font-weight: bold; font-style: italic;">temp2</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'raj'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'raj@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'admin'</span>) }
            <span style="font-weight: bold; font-style: italic;">inst2</span> = User(temp2)
            sys.add_user(inst2,normal_logged[0])
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">proper instances not passed</span>
            <span style="font-weight: bold; font-style: italic;">temp2</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'raj'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'raj@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'admin'</span>) }
            <span style="font-weight: bold; font-style: italic;">inst2</span> = User(temp2)
            sys.add_user(admin_logged[0],inst2)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-2" class="outline-5">
<h5 id="sec-2-8-6-2"><span class="section-number-5">2.8.6.2</span> showUsers</h5>
<div class="outline-text-5" id="text-2-8-6-2">
</div><ol class="org-ol"><li><a id="sec-2-8-6-2-1" name="sec-2-8-6-2-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-2-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">show_users</span>(<span style="font-weight: bold;">self</span>,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list :
                <span style="font-weight: bold;">return</span> copy.deepcopy(<span style="font-weight: bold;">self</span>.users)
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'Session not in session list'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-2-2" name="sec-2-8-6-2-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-2-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_showusers</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: show_users'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold; font-style: italic;">a</span> = sys.show_users(admin_logged[0])
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(0,<span style="font-weight: bold;">len</span>(a)):
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(a[i].get_email()),<span style="font-weight: bold;">str</span>(sys.users[i].get_email()))
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(a[i].get_name()),<span style="font-weight: bold;">str</span>(sys.users[i].get_name()))
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(a[i].get_role()),<span style="font-weight: bold;">str</span>(sys.users[i].get_role()))
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-3" class="outline-5">
<h5 id="sec-2-8-6-3"><span class="section-number-5">2.8.6.3</span> deluser</h5>
<div class="outline-text-5" id="text-2-8-6-3">
</div><ol class="org-ol"><li><a id="sec-2-8-6-3-1" name="sec-2-8-6-3-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-3-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">del_user</span>(<span style="font-weight: bold;">self</span>,user,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> session.get_user().get_role()==<span style="font-style: italic;">'admin'</span> <span style="font-weight: bold;">and</span> user.get_role()!=<span style="font-style: italic;">'admin'</span> <span style="font-weight: bold;">and</span> session.get_user()!=user:
                 <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list :
                    <span style="font-weight: bold;">self</span>.users.remove(user)
                 <span style="font-weight: bold;">else</span> :
                    <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user not in list or session not present'</span>)
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'only admin can delete and admin cannot be removed'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of user and session not passed'</span>)
</pre>
</div>
</div>
</li>
