build/docs/implementation/objects/index.html

<li><a id="sec-2-8-6-3-2" name="sec-2-8-6-3-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-3-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_deluser</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: del_users'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">normal user trying to delete user</span>
            <span style="font-weight: bold; font-style: italic;">temp2</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'raj'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'raj@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'normal'</span>) }
            <span style="font-weight: bold; font-style: italic;">inst2</span> = User(temp2)
            sys.users.append(inst2)
            sys.del_user(inst2,normal_logged[0])
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">you cannot delete an admin</span>
            <span style="font-weight: bold; font-style: italic;">temp3</span> = {<span style="font-style: italic;">'name'</span>: Name(<span style="font-style: italic;">'raja'</span>), <span style="font-style: italic;">'email'</span>: Email(<span style="font-style: italic;">'raja@gmail.com'</span>) , <span style="font-style: italic;">'role'</span>: Role(<span style="font-style: italic;">'admin'</span>) }
            <span style="font-weight: bold; font-style: italic;">inst3</span> = User(temp3)
            sys.users.append(inst3)
            sys.del_user(inst3,admin_logged[0])
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError): <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">cannot delete oneself</span>
            sys.del_user(admin_logged[0].get_user(),admin_logged[0])
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-4" class="outline-5">
<h5 id="sec-2-8-6-4"><span class="section-number-5">2.8.6.4</span> getuserbyemail</h5>
<div class="outline-text-5" id="text-2-8-6-4">
</div><ol class="org-ol"><li><a id="sec-2-8-6-4-1" name="sec-2-8-6-4-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-4-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">getUserByEmail</span>(<span style="font-weight: bold;">self</span>,email,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(session,Session) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(email,Email):
            <span style="font-weight: bold;">if</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                <span style="font-weight: bold;">return</span> [user <span style="font-weight: bold;">for</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">if</span> user.get_email()==email.get_email()]
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'session not valid'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of Email and session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-4-2" name="sec-2-8-6-4-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-4-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_getuserbyemail</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: get_user by email'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold; font-style: italic;">a</span> = sys.getUserByEmail(Email(<span style="font-style: italic;">'john@gmail.com'</span>),admin_logged[0])
        <span style="font-weight: bold;">self</span>.assertEqual(a[0].get_name(),<span style="font-style: italic;">'john'</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">len</span>(a),1)
        <span style="font-weight: bold;">self</span>.assertEqual(a[0].get_email(),<span style="font-style: italic;">'john@gmail.com'</span>)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-5" class="outline-5">
<h5 id="sec-2-8-6-5"><span class="section-number-5">2.8.6.5</span> getEmail</h5>
<div class="outline-text-5" id="text-2-8-6-5">
</div><ol class="org-ol"><li><a id="sec-2-8-6-5-1" name="sec-2-8-6-5-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-5-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_email</span>(<span style="font-weight: bold;">self</span>,user,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                <span style="font-weight: bold;">return</span> [u.get_email() <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">if</span> u==user][0]
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user doesnot exists or invalid session'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-5-2" name="sec-2-8-6-5-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-5-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_getemail</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: get_email'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold; font-style: italic;">a</span> = sys.get_email(normal_logged[0].get_user(),admin_logged[0])
        <span style="font-weight: bold;">self</span>.assertEqual(a,<span style="font-style: italic;">'johnsnow@gmail.com'</span>)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-6" class="outline-5">
<h5 id="sec-2-8-6-6"><span class="section-number-5">2.8.6.6</span> getName</h5>
<div class="outline-text-5" id="text-2-8-6-6">
</div><ol class="org-ol"><li><a id="sec-2-8-6-6-1" name="sec-2-8-6-6-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-6-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_name</span>(<span style="font-weight: bold;">self</span>,user,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                <span style="font-weight: bold;">return</span> [u.get_name() <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">if</span> u==user][0]
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user doesnot exists or invalid session'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of session not passed'</span>)
</pre>
</div>
</div>
</li>
