build/docs/implementation/objects/index.html

<li><a id="sec-2-8-6-6-2" name="sec-2-8-6-6-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-6-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_getname</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: get_email'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold; font-style: italic;">a</span> = sys.get_name(normal_logged[0].get_user(),admin_logged[0])
        <span style="font-weight: bold;">self</span>.assertEqual(a,<span style="font-style: italic;">'johnsnow'</span>)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-7" class="outline-5">
<h5 id="sec-2-8-6-7"><span class="section-number-5">2.8.6.7</span> getrole</h5>
<div class="outline-text-5" id="text-2-8-6-7">
</div><ol class="org-ol"><li><a id="sec-2-8-6-7-1" name="sec-2-8-6-7-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-7-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_role</span>(<span style="font-weight: bold;">self</span>,user,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                <span style="font-weight: bold;">return</span> [u.get_role() <span style="font-weight: bold;">for</span> u <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">if</span> u==user][0]
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user doesnot exists or invalid session'</span>)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Instance of session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-7-2" name="sec-2-8-6-7-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-7-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_getemail</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: get_email'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold; font-style: italic;">a</span> = sys.get_role(admin_logged[0].get_user(),admin_logged[0])
        <span style="font-weight: bold;">self</span>.assertEqual(a,<span style="font-style: italic;">'admin'</span>)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-8" class="outline-5">
<h5 id="sec-2-8-6-8"><span class="section-number-5">2.8.6.8</span> setEmail</h5>
<div class="outline-text-5" id="text-2-8-6-8">
</div><ol class="org-ol"><li><a id="sec-2-8-6-8-1" name="sec-2-8-6-8-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-8-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">set_email</span>(<span style="font-weight: bold;">self</span>,user,email,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(email,Email):
            <span style="font-weight: bold;">if</span> session.user.get_role()==<span style="font-style: italic;">'admin'</span> <span style="font-weight: bold;">or</span> session.user==user:
               <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                   <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(0,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.users)):
                       <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.users[i] == user:
                           <span style="font-weight: bold; font-style: italic;">user.email</span> = email
                           <span style="font-weight: bold;">self</span>.users[i] = user
               <span style="font-weight: bold;">else</span> :
                   <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user not existing or session expired'</span>)
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'Only admin of same user can edit the email'</span>)
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Proper instances of user,email, session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-8-2" name="sec-2-8-6-8-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-8-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_setemail</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: set_email'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        sys.set_email(normal_logged[0].get_user(),Email(<span style="font-style: italic;">'johnraj@gmail.com'</span>),admin_logged[0]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">admin changing</span>
        <span style="font-weight: bold;">self</span>.assertEqual(normal_logged[0].get_user().get_email(),<span style="font-style: italic;">'johnraj@gmail.com'</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(sys.getUserByEmail(Email(<span style="font-style: italic;">'johnraj@gmail.com'</span>),admin_logged[0])[0],normal_logged[0].get_user())
        sys.set_email(normal_logged[0].get_user(),Email(<span style="font-style: italic;">'johnsnow@gmail.com'</span>),admin_logged[0]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">user changing bakc</span>
        <span style="font-weight: bold;">self</span>.assertEqual(normal_logged[0].get_user().get_email(),<span style="font-style: italic;">'johnsnow@gmail.com'</span>)
        <span style="font-weight: bold;">self</span>.assertEqual(sys.getUserByEmail(Email(<span style="font-style: italic;">'johnsnow@gmail.com'</span>),admin_logged[0])[0],normal_logged[0].get_user())
</pre>
</div>
</div>
</li></ol>
</div>
