build/docs/implementation/objects/index.html


<div id="outline-container-sec-2-8-6-9" class="outline-5">
<h5 id="sec-2-8-6-9"><span class="section-number-5">2.8.6.9</span> setName</h5>
<div class="outline-text-5" id="text-2-8-6-9">
</div><ol class="org-ol"><li><a id="sec-2-8-6-9-1" name="sec-2-8-6-9-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-9-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">set_name</span>(<span style="font-weight: bold;">self</span>,user,name,session):
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(user,User) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(session,Session) <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(name,Name):
            <span style="font-weight: bold;">if</span> session.user.get_role()==<span style="font-style: italic;">'admin'</span> <span style="font-weight: bold;">or</span> session.user==user:
               <span style="font-weight: bold;">if</span> user <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.users <span style="font-weight: bold;">and</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
                   <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(0,<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.users)):
                       <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.users[i] == user:
                           <span style="font-weight: bold; font-style: italic;">user.name</span> = name
                           <span style="font-weight: bold;">self</span>.users[i] = user
               <span style="font-weight: bold;">else</span> :
                   <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'user not existing or session expired'</span>)
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'Only admin of same user can edit the email'</span>)
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'Proper instances of user,email, session not passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-9-2" name="sec-2-8-6-9-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-9-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_setname</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: set_name'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        sys.set_name(normal_logged[0].get_user(),Name(<span style="font-style: italic;">'johnraj'</span>),admin_logged[0]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">admin changing</span>
        <span style="font-weight: bold;">self</span>.assertEqual(normal_logged[0].get_user().get_name(),<span style="font-style: italic;">'johnraj'</span>)
        sys.set_name(normal_logged[0].get_user(),Name(<span style="font-style: italic;">'johnsnow'</span>),normal_logged[0]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">user changing bakc</span>
        <span style="font-weight: bold;">self</span>.assertEqual(normal_logged[0].get_user().get_name(),<span style="font-style: italic;">'johnsnow'</span>)
</pre>
</div>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-8-6-10" class="outline-5">
<h5 id="sec-2-8-6-10"><span class="section-number-5">2.8.6.10</span> showsessions</h5>
<div class="outline-text-5" id="text-2-8-6-10">
</div><ol class="org-ol"><li><a id="sec-2-8-6-10-1" name="sec-2-8-6-10-1"></a>Implementation<br  /><div class="outline-text-6" id="text-2-8-6-10-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">showSessions</span>(<span style="font-weight: bold;">self</span>,session):
        <span style="font-weight: bold;">if</span>  <span style="font-weight: bold;">isinstance</span>(session,Session):
            <span style="font-weight: bold;">if</span> session <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.session_list:
               <span style="font-weight: bold;">if</span> session.get_user().get_role() == <span style="font-style: italic;">'admin'</span>:
                   <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.session_list[:]
               <span style="font-weight: bold;">else</span> :
                   <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'only admin can get session list'</span>)
            <span style="font-weight: bold;">else</span> :
                <span style="font-weight: bold;">raise</span> ConstraintError(<span style="font-style: italic;">'session expired'</span>)
        <span style="font-weight: bold;">else</span> :
            <span style="font-weight: bold;">raise</span> ConstraintError (<span style="font-style: italic;">'instance of session class has to be passed'</span>)
</pre>
</div>
</div>
</li>

<li><a id="sec-2-8-6-10-2" name="sec-2-8-6-10-2"></a>Test<br  /><div class="outline-text-6" id="text-2-8-6-10-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test_showsessions</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">'testing System: show session'</span>
        <span style="font-weight: bold;">global</span> sys
        <span style="font-weight: bold; font-style: italic;">admin_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'admin'</span>]
        <span style="font-weight: bold; font-style: italic;">normal_logged</span> = [s <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> sys.session_list <span style="font-weight: bold;">if</span> s.get_user().get_role()==<span style="font-style: italic;">'normal'</span>]
        <span style="font-weight: bold;">with</span> <span style="font-weight: bold;">self</span>.assertRaises(ConstraintError):
            <span style="font-weight: bold; font-style: italic;">a</span> = sys.showSessions(normal_logged[0])
        <span style="font-weight: bold; font-style: italic;">b</span> = sys.showSessions(admin_logged[0])
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(0,<span style="font-weight: bold;">len</span>(b)):
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(b[i].get_user().get_email()),<span style="font-weight: bold;">str</span>(sys.session_list[i].get_user().get_email()))
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(b[i].get_user().get_name()),<span style="font-weight: bold;">str</span>(sys.session_list[i].get_user().get_name()))
            <span style="font-weight: bold;">self</span>.assertEqual(<span style="font-weight: bold;">str</span>(b[i].get_user().get_role()),<span style="font-weight: bold;">str</span>(sys.session_list[i].get_user().get_role()))
</pre>
</div>
</div>
</li></ol>
</div>
</div>
</div>


<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> Main</h3>
<div class="outline-text-3" id="text-2-9">
</div><div id="outline-container-sec-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> Construction</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
the main class containing login and delete session
</p>

<div class="org-src-container">

<pre class="src src-python"></pre>
</div>
</div>
</div>
